app/controllers/archivos_controller.rb

  def index
    redirect_to :action => 'index' if params[:page] && params[:page].to_i == 1
    params[:page] ||= 1

    conditions = []
    conditions = ["(UPPER(url) LIKE :nombre or UPPER(nombre) LIKE :nombre)", {:nombre => "%#{params[:buscar]}%"}] if params[:clave].to_s != ""
    if params[:tipo].to_s != ""
      if params[:clave].to_s != ""
        conditions[0] += " AND"
        conditions[0] += " tipo = :tipo"
      else
        conditions[0] = " tipo = :tipo"
        conditions[1] = {}
      end
      conditions[1][:tipo] = params[:tipo].to_i
    end
    @archivos = Archivo.paginate(:all, :page => params[:page], :per_page => 15, :conditions => conditions)
---
SELECT * FROM `archivos` WHERE ((UPPER(url) LIKE '%fuentes%' or UPPER(nombre) LIKE '%fuentes%') AND tipo = 1) ORDER BY updated_at DESC, fecha_fisica DESC, nombre LIMIT 0, 15
SELECT count(*) AS count_all FROM `archivos`

  def auto_complete_for_archivo_url
    @carpetas_encontradas = Archivo.all(:limit => 15, :order => "updated_at DESC", :conditions => ["tipo = ? AND UPPER(url) LIKE UPPER(?)", Archivo::TIPO_ARCHIVO["Carpeta"], "%#{params[:archivo][:url]}%"])
---
SELECT * FROM `archivos` WHERE (tipo = 3 AND UPPER(url) LIKE UPPER('%a%')) ORDER BY updated_at DESC, fecha_fisica LIMIT 15

  def buscar_archivos_para_entrada
    @s = params[:s]
    conditions = ["UPPER(url) LIKE UPPER(?)", "%#{@s}%"]
    if params[:solo_carpeta].to_i == 1
      conditions[0] += " AND tipo = ?"
      conditions << Archivo::TIPO_ARCHIVO["Carpeta"]
    end

    @archivos = Archivo.paginate(:conditions => conditions, :page => params[:page], :per_page => 10, :order => "ID desc")
---
SELECT * FROM `archivos` WHERE (UPPER(url) LIKE UPPER('%afiche%') AND tipo = 3) ORDER BY ID desc, fecha_fisica DESC, nombre LIMIT 0, 10
SELECT count(*) AS count_all FROM `archivos` WHERE (UPPER(url) LIKE UPPER('%archivo%'))

  def agregar_a_entrada
    @archivo = Archivo.find params[:archivo_id]
---
SELECT * FROM `archivos` WHERE (`archivos`.`id` = 57) ORDER BY fecha_fisica DESC

  def edit
    @archivo = Archivo.find params[:id]
---
SELECT * FROM `archivos` WHERE (`archivos`.`id` = 51) ORDER BY fecha_fisica DESC, nombre

  def update
    @archivo = Archivo.find params[:id]
    if @archivo.update_attributes params[:archivo]
---
SELECT * FROM `archivos` WHERE (`archivos`.`id` = 51) ORDER BY fecha_fisica DESC, nombre
UPDATE `archivos` SET `updated_at` = '2010-01-03 03:52:32', `fecha_fisica` = '2009-12-29 20:47:00' WHERE `id` = 51