app/controllers/entradas_controller.rb

SELECT id, nombre, muestra_contenido, pagina_id FROM `entradas` WHERE (UPPER(nombre) LIKE UPPER('%otra%')) ORDER BY id DESC LIMIT 0, 15
---
  def index
    conditions = {}
    conditions = ["UPPER(nombre) LIKE UPPER(:s)", {:s => "%#{params[:s]}%"}] if(params[:s].to_s != "")
    @entradas = Entrada.paginate :all, :page => params[:page], :per_page => 15, :order => "id DESC", :conditions => conditions

SELECT * FROM `entradas` WHERE (`entradas`.`id` = 1)
---
  def show
    @entrada = Entrada.find params[:id]

INSERT INTO `entradas` (`pagina_id`, `created_at`, `nombre`, `usuario_id`, `updated_at`, `url`, `contenido`, `borrador`, `muestra_contenido`) VALUES(1, '2009-11-07 03:12:00', 'Prueba', NULL, '2009-11-07 03:12:00', 'prueba', '<p>Si buenas</p>', 0, 1)
---
  def create
    @entrada = Entrada.new params[:entrada]
    @archivos = params[:archivos]
    if @entrada.save

SELECT * FROM `entradas` WHERE (`entradas`.`id` = 1) ORDER BY updated_at DESC
---
  def edit
    @entrada = Entrada.find params[:id]

SELECT * FROM `entradas` WHERE (`entradas`.`id` = 1) ORDER BY updated_at DESC
---
  def update
    @entrada = Entrada.find params[:id]