app/controllers/paginas_controller.rb

SELECT * FROM `paginas` ORDER BY prioridad
---
  def index
    @paginas = Pagina.all

SELECT * FROM `paginas` WHERE (`paginas`.`url` = 'videos-de-adentro') AND (`paginas`.pagina_madre_id = 2) LIMIT 1
---
  def show
    if params[:url].kind_of? Array
      url = params[:url].join("/")
    else
      url = params[:url].to_s
    end

    url = "/"+url unless url.start_with?("/")

    #@pagina = url == "/" ? Pagina.find_by_url("/") : Pagina.find_by_url(url)
    @pagina = Pagina.find_by_url(url)

INSERT INTO `paginas` (`created_at`, `nombre`, `updated_at`, `url`, `descripcion`, `pagina_madre_id`, `clave`) VALUES('2009-10-25 07:46:06', 'Inicio', '2009-10-25 07:46:06', '/', '<p>Este es una entrada de prueba <a href=\"http://mensajefinal.net\" title=\"AJA\">link!</a></p>', NULL, '')
---
  def create
    @pagina = Pagina.new params[:pagina]
    if @pagina.save

SELECT * FROM `paginas` WHERE (`paginas`.`id` = 1)
---
  def edit
    @pagina = Pagina.find params[:id]

SELECT * FROM `paginas` WHERE (`paginas`.`id` = 3)
UPDATE `paginas` SET `updated_at` = '2009-11-08 17:19:58', `pagina_madre_id` = 2, `url` = 'inicio' WHERE `id` = 1
---
  def update
    @pagina = Pagina.find params[:id]
    if @pagina.update_attributes(params[:pagina])

SELECT * FROM `paginas` WHERE (`paginas`.`id` = 3)
---
  def insertar_clave
    @pagina = Pagina.find params[:id]