app/controllers/usuarios_controller.rb

  def index
    options = {:page => params[:page], :per_page => 15, :order => "id DESC"}
    options[:conditions] = ["UPPER(email) LIKE :s OR UPPER(nombre) LIKE UPPER(:s)", {:s => "%#{params[:s]}%"}] if params[:s]
    @usuarios = Usuario.paginate :all, options
---
SELECT * FROM `usuarios` WHERE (UPPER(email) LIKE 'UPPER(\'%ricar%\')' OR UPPER(nombre) LIKE 'UPPER(\'%ricar%\')') ORDER BY id DESC LIMIT 0, 15

  def show
    @usuario = Usuario.find params[:id]
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 1) LIMIT 1

  def create
    @usuario = Usuario.new params[:usuario]
    if @usuario.save
---
INSERT INTO `usuarios` (`localizacion`, `imagen`, `created_at`, `nombre`, `updated_at`, `password_salt`, `autorizacion`, `password_hash`, `email`) VALUES('Colombia', NULL, '2009-11-08 05:35:13', 'Ricardo', '2009-11-08 05:35:13', '3RjhNUkN', 1, '33dcaf8c4d517f0d6c783ceec9a0710cf50e558dae1f936776c8dc2b2f02c021', 'recontrapanche@gmail.com')

  def edit
    @usuario = Usuario.find params[:id]
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 1) LIMIT 1

  def update
    @usuario = Usuario.find params[:id]
    if @usuario.update_attributes params[:usuario]
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 2)
UPDATE `usuarios` SET `updated_at` = '2009-11-22 18:24:23', `nombre` = '....' WHERE `id` = 2

  def destroy
    @usuario = Usuario.find params[:id]
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 1)

  def editome
    @usuario = Usuario.find params[:id]
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1